{
    "1": {
        "name": "Kontostand einsehen",
        "task": "**Kontostand einsehen**\n\nIn diesem Diagram wird das Einsehen des Kontostands beschrieben und besitzt genau einen Akteur nämlich den Bankkunden. \n\nUm den Kontostand Ihres Bankkontos einzusehen, müssen Sie sich zunächst auf der Webseite Ihrer Bank einloggen. Nachdem Sie Ihre Logindaten eingegeben haben, wird geprüft, ob diese korrekt sind. Falls nicht, können Sie Ihre Logindaten erneut eingeben, bis diese drei mal falsch eingegeben wurden. In diesem Fall wird das Konto gesperrt und der Kontostand kann nicht mehr eingesehen werden. Wenn Ihre Logindaten korrekt sind, wird eine Benachrichtigung an die PushTan-App gesendet, um einen Auftrag zu bestätigen. Sobald Sie die App geöffnet und sich einmal eingeloggt haben, können Sie den Auftrag freigeben. Nach der Freigabe wird wieder auf die Webseite gewechselt, um den Kontostand einsehen zu können.", 
        "diagram": "/xml/KontostandEinsehen.xml"
    },
    "2": {
        "name": "Praktikumsabgabe",
        "task": "**Praktikumsabgabe** \n\nDas Diagramm beschreibt den Ablauf einer Praktikumsabgabe, bei der zwei Akteure beteiligt sind: der Dozent und der Student. Der Dozent lädt das Praktikum hoch und kontrolliert die Abgaben. Bevor das Praktikum hochgeladen werden kann, müssen diese erstellt werden und den Studenten Bescheid gegeben werden. Nach dem Hochladen bis zur Kontrolle passiert aber auch noch was. Damit der Dozent die ganzen Abgaben erhalten kann, muss dieser eine Frist setzen und eine Abgabe einrichten. Nach der Kontrolle, werden dann die Bonuspunkte vergeben.\n\nKommen wir nun zum Studenten. Nachdem der Student die Email erhalten hat, muss sich dieser ins Ilias der Fachhochschule Dortmund einloggen um die Aufgaben anzusehen und runterladen zu können. Da das ja nur Bonuspunkte sind, kann der Student entscheiden, ob dieser die Aufgaben bearbeiten wird oder nicht. Falls entschieden wurde, die Aufgaben zu bearbeiten, werden diese bearbeitet und eventuell wird Hilfe bei der Bearbeitung gebraucht. Nachdem diese gelöst worden sind, werden die Aufgaben abgegeben und bei rechtzeitiger Abgabe gibt es dann auch Bonuspunkte.\n\nEs gibt insgesamt vier Datenobjekte und zwei Nachrichtenflüsse zwischen den beiden Akteuren. Die Beschriftungen und Elemente können Sie sich in der Liste unter der Aufgabe anschauen.", 
        "diagram": "/xml/Praktikumsabgabe.xml"
    } ,
    "3": {
        "name": "Arzttermin",
        "task": "**Arzttermin** \n\nDieses Diagram soll den Ablauf einer Terminvereinbarung mit einem Arzt darstellen. Dabei spielen die zwei Akteure Patient und Rezeptionist eine Rolle.\n\nBei einem gesundheitlichem Problem muss der Patient einen Arzt besuchen und dafür muss er einen Termin vereinbaren. Somit sucht dieser sich einen Arzt raus und ruft diesen an. Anschließend fragt er nach einem freien Termin und wartet auf eine Antwort. Falls der Termin passt bestätigt der Patient diesen und verabschiedet sicht. Im Fall dass der Termin doch nicht passt, wird dankend abgelehnt und der Patient hat keinen Termin erhalten.\n\nDer Rezeptionist erhält einen Anruf und nimmt diesen entgegen. Auf die Terminnachfrage wird geprüft, wann es Termine gibt und dementsprechend der nächste Termin wird angeboten. Nach dem Angebot wird auf die Antwort des Patienten gewartet und dementsprechend gehandelt. Wird der Termin bestätigt, kommt noch eine Bestätigung per SMS und der Termin wird zum Schluss eingetragen.\nBei einer Absage verabschiedet sich der Rezeptionist und beendet den Anruf.",
        "diagram": "/xml/Arzttermin.xml"
    },
    "4": {
        "name": "Prüfungsablauf",
        "task": "**Prüfungsablauf**\n\nDieses Diagram soll eine Prüfung darstellen angefangen von der Prüfungsanmeldung bis zur Noteneintragung. Das Diagram beinhaltet drei Akteure, die jeweils eine wichtige Rolle in diesem Ablauf spielen.\n\nAngefangen wird hier mit dem Studenten der sich für eine Prüfung anmelden will. Nach der erfolgreichen Anmeldung schreibt der Student die Klausur. Danach wartet der Student ausgiebig auf die Klausurnoten. Wenn die Klausurnoten veröffentlicht wurden, meldet sich der Student im Hisinone an um seine Note abzurufen.\n\nNeben dem Studenten passiert hinter den Kulissen aber noch etwas. Das Studienbüro erhält die Prüfungsanmeldung vom Studenten. Dieses überprüft dann, ob dieser die Voraussetzungen erfüllt oder nicht. Abhängig davon wird die Prüfung an- oder abgemeldet. Falls die Anmeldung erfolgreich ist, wird eine weitere Anmeldung an der gleichen Klausur bis auf weiteres deaktiviert. Wenn es soweit ist werden alle Klausurtermine veröffentlicht und die Klausurenphase gestartet. Hier wartet das Studienbüro nur noch auf die ganzen Noten um diese später zu veröffentlichen und die Klausurenphase zu beenden.\n\nUm die Klausuren zu korrigieren und die Noten eintragen zu können brauchen wir noch den Dozenten. Dieser erhält die geschriebenen Klausuren eines Kurses und korrigiert diese. Anschließend werden die Noten eingetragen, die das Studienbüro dann bekommt. Nach der Eintragung der Noten werden die Studenten darüber benachrichtigt .\n\nAußerdem gibt es drei Datenobjekte und zwei Datenbankobjekte. Überlegen Sie an welchen Elemente diese angebracht wären. Falls Sie dabei Hilfe brauchen, schauen Sie sich die Elementliste unter dieser Aufgabe an. Die zwei Datenbankobjekte sind nur im Akteur Student enthalten.",
        "diagram": "/xml/Prüfungsablauf.xml"
    },
    "5": {
        "name": "Pizzabestellung",
        "task": "**Pizzabestellung**\n\nDieses Diagram beschreibt eine Pizzabestellung und die Beschriftungen sind auf Englisch. Es besitzt genau zwei Akteure und zwar dem Pizza Customer und dem Pizza Vendor. Jedoch besitzt der Pizza Vendor drei Lanes, die seine Aufgaben in drei Kategorien aufteilt.\n\nAngefangen wird hier mit dem Pizza Customer, der hungrig geworden ist. Da dieser gerne was essen möchte, sucht dieser sich eine Pizza aus und bestellt diese. Nach der Bestellung wartet dieser auf die Pizza, jedoch maximal 60 Minuten. Falls 60 Minuten um sind fragt dieser den Pizza Vendor nach der Pizza, wo die bleibt. Wird die Pizza geliefert, zahlt der Pizza Customer und isst die Pizza um seinen Hunger zu sättigen.\n\nDer Pizza Vendor erhält die Bestellung und verarbeitet diese und fängt mit dem Zubereiten der Pizza an. Jedes mal wenn der Pizza Customer nach der Pizza fragt, wird dieser beruhigt. Nach der Zubereitung wird Pizza geliefert und erhält die Bezahlung.\n\nHier gibt es drei Nachrichtenflüsse. Überlegen Sie sich wo die am besten hinpassen. Achten Sie dabei auf die MessageCatch Events!",
        "diagram": "/xml/PizzaOrderExample.xml"
    } 
}