{
    "1": {
        "task": "**Pizza Bestellung**", 
        "diagram": "/xml/PizzaOrderExample.xml",
        "tips": ""
    },
    "2": {
        "task": "**Nobelpreis** Modellieren Sie das Auswahlverfahren für den Nobelpreis in Form von BPMN 2.0. Das Auswahlverfahren für den Nobelpreis umfasst die folgende Schritte: \n\nErnennung: Das Nobelpreiskomitee sendet das Nominierungsformular an den Ernener. Die Liste der Ernenner wird von der Datenbank abgerufen. Nachdem der Ernenner die potenziellen Kandidaten gefunden und die ausgefüllten Formulare an das Komitee zurückgeschickt hat, werden diese Formulare gesammelt und in der Datenbank gespeichert. \n\nBewertung: Nachdem das Komitee alle Nominierungsformulare überprüft und vorläufige Kandidaten ausgewählt hat, falls die fachkundige Unterstützung erforderlich ist, wird die Liste der vorläufigen Kandidaten an den Experten gesendet. Danach greifen die Experten auf die Arbeit der Kandidaten zu und senden die Bewertungsberichte des Kandidaten an das Komitee zurück. Falls die fachkundige Unterstützung nicht erforderlich ist, werden die endgültigen Kandidaten und ihre Arbeiten ausgewählt. \n\nEndgültige Auswahl: Die Nobelpreiskomitees stimmen über die endgültigen Preisträger für jede Kategorie ab.\n\nAm Ende wird die Zeremonie abgehalten.\n\nDie vorgegebene Beschriftungen:\nListe der Ernenner / Nominierungsformular senden/ ausgefüllte Formulare sammeln/ Nobelpreiskomitee/ Ernenner/ Expert/ ausgefüllte Nominierungsformulare / überprüfen und vorläufige Kandidaten auswählen/ fachkundige Unterstützung erforderlich ?/ Liste der vorläufigen Kandidaten/ Liste der vorläufigen Kandidaten senden / den Bewertungsbericht der Kandidaten senden/ auf die Arbeit der Kandidaten zugreifen/ Bewertungen der Kandidaten/ Bewertungsberichte der Kandidaten sammeln/ die endgültigen Kandidaten und ihre Arbeiten auswählen/ Preisträgerinnen auswählen und ankündigen/ Zeremonie abhalten/potenzielle Kandidaten ermitteln/ ausgefüllte Formulare versenden",
        "diagram": "/xml/Nobelpreis.xml",
        "tips": ""
    } ,
    "3": {
        "task": "**Arzttermin** ",
        "diagram": "/xml/Arzttermin.xml",
        "tips": ""
    } 
}